Revit 2027 API
CurtainGrid.GetUGridLineIds Method
 Gets all ElementIds of grid lines in the U direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetUGridLineIds()
Public Function GetUGridLineIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetUGridLineIds()
member GetUGridLineIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The U grid line ElementIds
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace